## Titanic Dataset

In [1]:
import datalabframework as dlf

In [2]:
logger = dlf.log.logger()

 - logtime
 - level
 - username
 - git hash
 - git last commit author
 - git last commit email
 - git last commit time
 - git last commit dirty
 - git repo
 - git origin
 - file path
 - file basename
 - msg (either dict or text)

## Extract Data

### Train dataset

In [3]:
engine = dlf.engines.get('pandas')

In [4]:
train = dlf.data.read('.elements.raw.train')

2018-02-28 18:21:24,139 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - Reading .elements.raw.train

In [5]:
train.stats()

2018-02-28 18:21:24,152 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - {'data': {'id': '.elements.raw.train', 'shape': {'rows': 891, 'cols': 12}, 'values': {'zero': 1850, 'empty': 0, 'none': 0, 'null': 866}, 'types': {'<i8': 5, '|O': 5, '<f8': 2}}, 'type': 'dataset', 'task': 'stats'}

{'id': '.elements.raw.train',
 'shape': {'cols': 12, 'rows': 891},
 'types': {'<f8': 2, '<i8': 5, '|O': 5},
 'values': {'empty': 0, 'none': 0, 'null': 866, 'zero': 1850}}

In [6]:
train.info()

{'engine': 'pandas',
 'format': 'csv',
 'name': '.elements.raw.train',
 'path': 'raw/train.csv',
 'provider': 'local',
 'uri': '.elements.raw.train'}

In [7]:
train.data.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
76,77,0,3,"Staneff, Mr. Ivan",male,NaN,0,0,349208,7.8958,NaN,S
370,371,1,1,"Harder, Mr. George Achilles",male,25.0,1,0,11765,55.4417,E50,C
457,458,1,1,"Kenyon, Mrs. Frederick R (Marion)",female,NaN,1,0,17464,51.8625,D21,S
399,400,1,2,"Trout, Mrs. William H (Jessie L)",female,28.0,0,0,240929,12.6500,NaN,S
400,401,1,3,"Niskanen, Mr. Juha",male,39.0,0,0,STON/O 2. 3101289,7.9250,NaN,S
853,854,1,1,"Lines, Miss. Mary Conover",female,16.0,0,1,PC 17592,39.4000,D28,S
229,230,0,3,"Lefebre, Miss. Mathilde",female,NaN,3,1,4133,25.4667,NaN,S
178,179,0,2,"Hale, Mr. Reginald",male,30.0,0,0,250653,13.0000,NaN,S
468,469,0,3,"Scanlan, Mr. James",male,NaN,0,0,36209,7.7250,NaN,Q
208,209,1,3,"Carr, Miss. Helen ""Ellen""",female,16.0,0,0,367231,7.7500,NaN,Q

In [8]:
train.data.dtypes.value_counts()

int64      5
object     5
float64    2
dtype: int64

In [9]:
train.data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
train.data.isin([0,'',None]).sum()

PassengerId      0
Survived       549
Pclass           0
Name             0
Sex              0
Age              0
SibSp          608
Parch          678
Ticket           0
Fare            15
Cabin            0
Embarked         0
dtype: int64

### Test Dataset

In [11]:
test = dlf.data.read('.elements.raw.test')

2018-02-28 18:21:24,316 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - Reading .elements.raw.test

In [12]:
dlf.data.info('.elements.raw.test')

{'engine': 'pandas',
 'format': 'csv',
 'name': '.elements.raw.test',
 'path': 'raw/test.csv',
 'provider': 'local',
 'uri': '.elements.raw.test'}

In [13]:
dlf.data.stats('.elements.raw.test')

2018-02-28 18:21:24,449 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - Reading .elements.raw.test
2018-02-28 18:21:24,456 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - {'data': {'id': '.elements.raw.test', 'shape': {'rows': 418, 'cols': 11}, 'values': {'zero': 609, 'empty': 0, 'none': 0, 'null': 414}, 'types': {'|O': 5, '<i8': 4, '<f8': 2}}, 'type': 'dataset', 'task': 'stats'}

{'id': '.elements.raw.test',
 'shape': {'cols': 11, 'rows': 418},
 'types': {'<f8': 2, '<i8': 4, '|O': 5},
 'values': {'empty': 0, 'none': 0, 'null': 414, 'zero': 609}}

In [14]:
test.data.sample(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
279,1171,2,"Oxenham, Mr. Percy Thomas",male,22.0,0,0,W./C. 14260,10.5000,NaN,S
137,1029,2,"Schmidt, Mr. August",male,26.0,0,0,248659,13.0000,NaN,S
333,1225,3,"Nakid, Mrs. Said (Waika Mary"" Mowad)""",female,19.0,1,1,2653,15.7417,NaN,C
252,1144,1,"Clark, Mr. Walter Miller",male,27.0,1,0,13508,136.7792,C89,C
226,1118,3,"Asplund, Mr. Johan Charles",male,23.0,0,0,350054,7.7958,NaN,S
332,1224,3,"Thomas, Mr. Tannous",male,NaN,0,0,2684,7.2250,NaN,C
317,1209,2,"Rogers, Mr. Reginald Harry",male,19.0,0,0,28004,10.5000,NaN,S
254,1146,3,"Wenzel, Mr. Linhart",male,32.5,0,0,345775,9.5000,NaN,S
143,1035,2,"Beauchamp, Mr. Henry James",male,28.0,0,0,244358,26.0000,NaN,S
405,1297,2,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",male,20.0,0,0,SC/PARIS 2166,13.8625,D38,C

In [15]:
test.data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [16]:
test.data.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [17]:
test.data.isin([0,'',None]).sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp          283
Parch          324
Ticket           0
Fare             2
Cabin            0
Embarked         0
dtype: int64

### Write out Extracted Data from Raw

If format conversion should happen it should be done here. In this particular example we assume that csv is our raw data and from here on all data is going to be compacted in binary format using HDF5 format. HDF5 allows to store multiple pandas DataFrame in the same file. This can be achieve by mapping multiple metadata aliases to the same data resource.

In [18]:
import warnings
warnings.filterwarnings('ignore')

In [19]:
train.write('train')
dlf.data.write(test, 'test')

2018-02-28 18:21:24,782 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - writing test

### Metrics on Raw Data

 A table with all the dataset being read
 
 - Number of Entries
 - Null Values
 - Type Purity

In [20]:
pd = dlf.engines.get("pandas").context()

In [23]:
index = ['train', 'test']
data  = [train.data.isnull().sum(), test.data.isnull().sum()]
metrics = pd.DataFrame(data, index, dtype='Int64')

metrics['_total'] = [train.data.shape[0], test.data.shape[0]]

In [24]:
# display the metrics on null fields
metrics

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,_total
train,177,687,2,0,0,0,0,0,0,0,0.0,0,891
test,86,327,0,1,0,0,0,0,0,0,NaN,0,418

In [26]:
index = ['train', 'test']
data  = [train.data.dtypes, test.data.dtypes]
schema = pd.DataFrame(data, index)

schema['_total'] = [train.data.shape[0], test.data.shape[0]]

In [27]:
# display the extracted schema for each attribute
schema

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,_total
train,float64,object,object,float64,object,int64,int64,int64,object,int64,int64,object,891
test,float64,object,object,float64,object,int64,int64,int64,object,int64,NaN,object,418

coerce (to be done)

### High Level summary metrics

This metrics are independent on the columns names and the number of columns

In [29]:
data = [train.data.dtypes.values, test.data.dtypes.values]
df  =  pd.DataFrame(data)

from collections import Counter
l = [item for sb in df.values.tolist() for item in sb]
d = dict(Counter(l))

#missing column between 'train' and 'test'
d[None]

1

#### For each data set
Collect shape, number of zero, Null, NaN elements, types

In [30]:
datasets =  ['.elements.raw.train', '.elements.raw.test']
for e in datasets:
    dlf.data.stats(e)

2018-02-28 18:25:03,437 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - Reading .elements.raw.train
2018-02-28 18:25:03,445 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - {'data': {'id': '.elements.raw.train', 'shape': {'rows': 891, 'cols': 12}, 'values': {'zero': 1850, 'empty': 0, 'none': 0, 'null': 866}, 'types': {'<i8': 5, '|O': 5, '<f8': 2}}, 'type': 'dataset', 'task': 'stats'}
2018-02-28 18:25:03,527 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - Reading .elements.raw.test
2018-02-28 18:25:03,534 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - {'data': {'id': '.elements.raw.test', 'shape': {'rows': 418, 'cols': 11}, 'values': {'zero': 609, 'empty': 0, 'none': 0, 'null': 414}, 'types': {'|O': 5, '<i8': 4, '<f8': 2}}, 'type': 'dataset', 'task': 'stats'}
2018-03-01 10:31:58,257 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - Closing idle connection 1, last active 57334068 ms ago
2018-03-01 10:31:58,258 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - <BrokerConnection node_id=1 host=localhost/127.0.0.1 port=29092>: Closing connection.
2018-03-01 10:31:58,259 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - Broker metadata change detected for node 1 from 127.0.0.1:29092 to localhost:29092
2018-03-01 10:31:58,260 - INFO - natbusa - 1384df7 - natbusa - natalino.busa@gmail.com - 1519787735 - True - https://github.com/natbusa/dsp-titanic.git - dsp-titanic - extract.ipynb - elements/extract - <BrokerConnection node_id=1 host=localhost/127.0.0.1 port=29092>: connecting to 127.0.0.1:29092